app/controllers/bottles_controller.rb

  def set_profile
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    bottle = Bottle.new(bottle_params)
    bottle.user_id = @user.id

    if bottle.save
---
INSERT INTO "bottles" ("vintage", "vineyard", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["vintage", 2001], ["vineyard", "Silver Oak"], ["user_id", 1], ["created_at", 2016-11-10 17:15:11 UTC], ["updated_at", 2016-11-10 17:15:11 UTC]]

  def show
    bottle = @user.bottles.find(params[:id])
---
SELECT  "bottles".* FROM "bottles" WHERE "bottles"."user_id" = $1 AND "bottles"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

  def update
    bottle = @user.bottles.find(params[:id])

    if bottle.update(bottle_params)
---
SELECT  "bottles".* FROM "bottles" WHERE "bottles"."user_id" = $1 AND "bottles"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
UPDATE "bottles" SET "vintage" = $1, "retail_price" = $2, "label" = $3, "updated_at" = $4 WHERE "bottles"."id" = $5  [["vintage", 2004], ["retail_price", 32], ["label", "http://cache.wine.com/labels/87150m.jpg"], ["updated_at", 2016-11-15 20:15:46 UTC], ["id", 26]]

  def destroy
    bottle = @user.bottles.find(params[:id])
    bottle.destroy
---
SELECT  "bottles".* FROM "bottles" WHERE "bottles"."user_id" = $1 AND "bottles"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
DELETE FROM "bottles" WHERE "bottles"."id" = $1  [["id", 2]]